Revit 2027 API
StructuralSection.ShearAreaStrongAxis Property
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ShearAreaStrongAxis { get; set; }
Public Property ShearAreaStrongAxis As Double
	Get
	Set
public:
property double ShearAreaStrongAxis {
	double get ();
	void set (double value);
}
member ShearAreaStrongAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace